precursor_kOmegaSST/0/k
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   nonuniform List<scalar> 
2160
(
2.68352e-05
2.84972e-05
2.68388e-05
0.000139409
0.000139789
0.000139446
0.000131115
0.000130619
...
)
;

boundaryField
{
    freeSurface
    {
        type            slip;
    }
    inlet
    {
        type            cyclic;
    }
    outlet
    {
        type            cyclic;
    }
    sidewalls
    {
        type            kqRWallFunction;
        value           nonuniform List<scalar> 
144
(
2.41786e-06
9.80791e-05
0.000127713
0.000188232
0.000250817
0.000283471
0.000350927
0.000384941
...
)
;
    }
    noSlipWalls
    {
        type            kqRWallFunction;
        value           nonuniform List<scalar> 
90
(
2.41786e-06
1.61189e-06
1.61189e-06
4.78067e-06
4.78067e-06
5.97861e-06
5.97861e-06
5.97861e-06
...
)
;
    }
}


// ************************************************************************* //
