precursor_kOmegaSST/0/omega
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      omega;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 -1 0 0 0 0];

internalField   nonuniform List<scalar> 
2160
(
1210.22
884.907
1210.22
1221.37
1206.28
1221.37
1348.13
1334.81
...
)
;

boundaryField
{
    freeSurface
    {
        type            slip;
    }
    inlet
    {
        type            cyclic;
    }
    outlet
    {
        type            cyclic;
    }
    sidewalls
    {
        type            omegaWallFunction;
        Cmu             0.09;
        kappa           0.41;
        E               9.8;
        beta1           0.075;
        blended         false;
        value           nonuniform List<scalar> 
144
(
1781.75
11.8804
13.5569
16.4585
18.9986
20.1975
22.4725
23.5364
...
)
;
    }
    noSlipWalls
    {
        type            omegaWallFunction;
        Cmu             0.09;
        kappa           0.41;
        E               9.8;
        beta1           0.075;
        blended         false;
        value           nonuniform List<scalar> 
90
(
1781.75
3557.7
3557.7
3557.7
3557.7
3557.7
3557.7
3557.7
...
)
;
    }
}


// ************************************************************************* //
